"""Содержит строки шаблонов ответов бота."""

stages_info = [
    {  # stage 1
        "text": "Здравствуйте!\n"
        'Я "Автосервис Фильтр Бот", помогаю осуществлять поиск и отслеживание заявок'
        ' на ремонт машин для канала <a href="https://t.me/{channel_name}">'
        "Автосервис Украина</a>.\n"
        "После настройки фильтра все заявки, подпадающие под его параметры, "
        "будут дублироваться вам в приват.\n\n"
        'Нажмите "Настроить фильтр".',
        "buttons": [
            [
                {
                    "text": "Настроить фильтр",
                    "callback_data": "new_request",
                },
            ],
        ],
    },
    {  # stage 2
        "text": "Если вы по какой-то причине не подписаны на канал "
        '<a href="https://t.me/{channel_name}">Автосервис Украина</a>, '
        'то перейдите по ссылке и подпишитесь. Затем нажмите "Далее".',
        "text_buttons": [
            [
                {
                    "text": "Далее",
                },
            ],
            [
                {
                    "text": "Отменить",
                }
            ],
        ],
    },
    {
        "text": "Выберите интересующие типа ремонтов и затем нажмите 'Далее':",
        "attr_choices": "repair_types",
        "text_buttons": [
            [
                {
                    "text": "Далее",
                }
            ],
            [
                {
                    "text": "Отменить",
                }
            ],
        ],
    },
    {
        "text": 'Выберите интересующие регионы и затем нажмите "Далее":',
        "attr_choices": "regions",
        "text_buttons": [
            [
                {
                    "text": "Далее",
                },
            ],
            [
                {
                    "text": "Отменить",
                }
            ],
        ],
    },
    {  # stage confirmation
        "text": "Вы молодец! Смотрите, что у нас получилось:",
        "text_buttons": None,
    },
    {  # stage done
        "text": "Ваш фильтр настроен:\n\n"
        "🛠️ {repair_types}\n\n"
        "📍 {regions}\n\n",
        "buttons": [
            [
                {
                    "text": "Перенастроить фильтр",
                    "callback_data": "new_request",
                },
            ]
        ],
    },
]

summary = {
    "text": "<b>Фильтр</b>\n\n"
    "🛠️ {repair_types} \n\n"
    "📍 {regions}\n\n",
    "buttons": [
        [
            {
                "text": "✅ Готово",
                "callback_data": "final_confirm {filter_pk}",
            },
            {
                "text": "❌ Заново",
                "callback_data": "restart",
            },
        ],
    ],
}

results = {
    "text": "<b>Десятка самых свежих результатов " "за последние три дня</b>:\n" ""
}
